questions = ["Принтер в автономном режиме",
"Поиск пароля WEP, WPA, WPA2 для беспроводной сети",
"Принтер не определяется при сетевой настройке драйвера",
"Поиск и устранение проблем беспроводного соединения",
"Какая версия Windows установлена на моем компьютере: 32 разрядная или 64 разрядная",
"Индикатор беспроводной связи мигает",
"Отменена печать файла блокированной печати",
"Значительная задержка между командой начала печати и фактическим началом печати",
"Отпечатки неровно укладываются",
"Весь отпечаток смазанный",
"Тонер порошкообразный и сдувается с бумаги или же напечатанное изображение имеет матовый вид",
"Конверты с отпечатанными изображениями выходят из аппарата смятыми",
"Предотвращение замятий бумаги",
"Застревание бумаги в лотках",
"Устранение замятий внутри аппарата",
"Листы бумаги слипаются",
"Бумага не подается в аппарат",
"Прозрачные пленки слипаются в области выхода бумаги",
"Конверты подаются с перекосом или неправильно",
"Постоянно происходит застревание бумаги",
"На аппарат не поддается питание",
"Аппарат не является устройством по умолчанию",
"Работа печати слишком сложная",
"Неправильно выбрана ориентация страницы",
"Фактический формат бумаги не соответствует выбранным настройкам",
"Кабель аппарата подключен неправильно или неисправен",
"Выбран неправильный драйвер для принтера ",
"Сбой приложения",
"Сбой операционной системы",
"При работе в среде DOS параметр шрифта аппарата установлен неправильно",
"Неправильно подключен соединительный кабель между компьютером и принтером",
"Соединительный кабель между компьютером и принтером неисправен",
"Указан неправильный порт",
"Неправильно настроены параметры аппарата",
"Драйвер принтера установлен неправильно",
"Произошел сбой в работе принтера",
"Неисправен тонер-картридж или закончился тонер",
"Файл документа может содержать пустые страницы",
"Неисправны какие-либо компоненты принтера например, контроллер или плата",
"Несовместимость файла PDF с программой Acrobat",
"Слишком низкое разрешение фотографии",
"Перед началом печати вблизи выходного лотка аппарата обнаруживаются испарения",
"Невозможно выполнить печать со смарт-устройства через Wi-Fi",
"Невозможно подключиться к интернету на смарт-устройстве",
"Невозможно выполнить печать с компьютера через Wi-Fi",
"Невозможно обновить внутреннее программное обеспечение",
"Не загружена бумага или подано более одного листа одновременно",
"Не вставлен лоток или в лотке отсутствует диск при печати на CD/DVD-диске",
"Произошло замятие бумаги",
"Невозможно протянуть бумагу из-за малого размера",
"Крышка принтера открыта во время печати",
"Скоро закончится срок службы прокладки, впитывающей чернила",
"Произошла ошибка принтера",
"Бумага подается неправильно",
"Замятие бумаги",
"Бумага подается под углом",
"Одновременно подается несколько листов бумаги",
"Бумага не подается",
"Питание не включается",
"Индикаторы зажглись и погасли",
"Питание не выключается",
"Невозможно выполнить печать с компьютера",
"Печатается очень бледное изображение или пустая страница",
"Низкое качество печати",
"Низкое качество печати фотографий",
"Изображения или фотографии печатаются с искаженными цветами",
"Невозможно выполнить печать без полей",
"Края изображения обрезаются при печати без полей",
"Потертости и размытие на бумаге",
"Символы напечатаны неправильно или с искажением",
"Напечатанное изображение перевернуто",
"Печать выполняется слишком медленно",
"При непрерывной печати скорость печати значительно замедляется.",
"Незначительные удары тока при касании к принтеру",
"Громкий шум при работе",
"Брандмауэр блокирует приложение ",
]

answers = ["""1.	Если у вас установлена ОС Windows 10 или 8, загрузите специальную версию приложения HP Print and Scan Doctor,
созданного для оказания помощи при устранении проблем, связанных условиями автономной работы принтера.
Если на вашем компьютере не используется Windows 10 или 8, перейдите к следующему шагу.

2.	Сброс настроек среды печати может восстановить подключение к принтеру и устройству, с которого выполняется печать.
1.	Выключите принтер, подождите 10 секунд, затем отсоедините шнур питания от принтера.
2.	Выключите компьютер или устройство, с которого вы пытаетесь выполнить печать.
3.	Подсоедините шнур питания к принтеру, затем включите принтер, если он автоматически не включается.
4.	Если принтер использует беспроводное подключение, перезапустите маршрутизатор.
3.	Драйвер принтера по умолчанию мог быть переустановлен на другой драйвер, например драйвер WSD
(веб-службы для устройств) с очень схожим названием. Измените драйвер печати по умолчанию
на исходно установленный драйвер и убедитесь, что принтер не настроен для использования в автономном режиме.
i.	  Выполните в Windows поиск по слову устройства и выберите Устройства и принтеры в списке результатов.
ii.	  Щелкните правой кнопкой мыши имя принтера HP, который является активным (не затененным), затем выберите 
Установить как принтер по умолчанию. 
iii.	Выполните попытку печати.""",
"""Чтобы подключить компьютер, телефон, беспроводной принтер или другой тип беспроводного устройства
к беспроводной сети, необходимо знать пароль сети.
При подписке на интернет-службу ваш поставщик услуг Интернета предоставляет вам сетевой пароль.
Этот пароль можно поискать на вашем маршрутизаторе беспроводной сети или в документации,
предоставленной поставщиком услуг Интернета.
Пароль может быть помечен как "Ключ беспроводной сети",
пароль безопасности, пароль WPA2, ключ WEP или аналогичным образом.
""",
"""1.	Перезагрузите компьютер, принтер и маршрутизатор

i.	Отсоедините кабель питания от маршрутизатора.
ii.	Выключите принтер.
iii.	Закройте все выполняющиеся программы на компьютере, в том числе окно установки программного обеспечения HP, а затем выключите компьютер.
iv.	Подключите кабель питания к маршрутизатору, затем подождите, пока индикатор активности подключения к Интернету не покажет нормальное состояние подключения.
v.	Включите принтер.
vi.	Включите компьютер.
vii.	Повторите попытку установки драйвера и программного обеспечения HP.
2.	Проверьте статус сетевого подключения и подключения принтера к сети

Убедитесь, что сеть работает исправно, и что принтер готов для настройки сетевого подключения.
1.	Убедитесь, что принтер готов для настройки сети. 
o	Беспроводное сетевое подключение: На принтере откройте меню "Беспроводная сеть" или меню "Параметры", чтобы убедиться в наличии сигнала беспроводной сети. Убедитесь, что индикатор рядом со значком беспроводного подключения горит ровно или мигает.
o	Проводное сетевое подключение: Убедитесь, что кабель подключен к порту Ethernet принтера и в свободный порт на корпусе маршрутизатора. Если кабель подключен, зеленый индикатор будет гореть, не мигая, а оранжевый индикатор активности будет мигать. 
o	
2.	Убедитесь, что ваш принтер не подключен к гостевой сети, например к сетям в школах, отелях или домашним сетям, требующим гостевого входа. 
3.	Если вы используете двухдиапазонный маршрутизатор, убедитесь, что он установлен в диапазон 2,4 ГГц. Если на маршрутизаторе настроена полоса частот 5 ГГц, подключение принтера к сети будет невозможным.
4.	На экране компьютера наведите указатель мыши на значок сети в области уведомлений, чтобы просмотреть имя сети и состояние подключения. 
3.	Подключите принтер к вашей сети вручную (только для беспроводных подключений)

Попробуйте подключить принтер к сети вручную, чтобы программа установки HP смогла обнаружить принтер. В случае наличия сенсорной или текстовой панели используйте Мастер настройки беспроводной сети, или используйте защищенный доступ Wi-Fi (WPS). После подключения повторите попытку установки драйвера и программного обеспечения HP.

4.	Запустите HP Print and Scan Doctor
Загрузите и запустите HP Print and Scan Doctor   для быстрого и автоматического устранения некоторых известных проблем. При переходе по этой ссылке загружается HP Print and Scan Doctor, используя функциональные возможности вашего интернет-браузера.
1.	После открытия HP Print and Scan Doctor щелкните Пуск на экране приветствия.
2.	Если ваш принтер не указан, убедитесь, что принтер включен и подключен к сети, щелкните Мой продукт не указан, затем щелкните Повторить.
3.	Выберите свой принтер и нажмите Добавить.
4.	Если обнаружена проблема с подключением, щелкните метод, который используется для подключения принтера, выполните инструкции на экране, затем щелкните Повторить.

5.	Временно отключите на компьютере программный брандмауэр

Программный брандмауэр блокирует угрозы, появляющиеся извне, однако некоторые параметры и настройки могут блокировать связь с сетевыми принтерами. Используйте Print and Scan Doctor для определения и временного отключения программного брандмауэра на компьютере.
1.	Вернитесь в окно Print and Scan Doctor и щелкните Сеть.
2.	В раскрывающемся меню выберите пункт Устранение неполадок с брандмауэрами.
3.	Щелкните имя любого программного брандмауэра в системе, состояние которого указано как Включено, затем щелкните Выключить.
4.	Повторите попытку установки драйвера и программного обеспечения HP.

Шаг 6. Удалите драйвер и программное обеспечение HP
Некоторые компоненты программного обеспечения HP могут быть установлены неправильно, даже если настройка принтера и драйвера была выполнена не полностью. 
1.	Если принтер подключен к компьютеру с помощью кабеля USB, отсоедините кабель от принтера.
2.	Выполните поиск по строке программы и компоненты в ОС Windows и выберите Программы и компоненты в списке результатов.
3.	В списке установленных программ выберите принтер HP и нажмите кнопку Удалить или Да.
4.	Для завершения процесса удаления программ следуйте инструкциям на экране.
5.	Перезагрузите компьютер.
""",
"""	Перезагрузите маршрутизатор и принтер для устранения состояний ошибок подключения.
Завершите все выполняющиеся задачи и загрузки перед выполнением этих действий и установите закладку на эту страницу, чтобы продолжить устранение неполадок, если проблемы с подключением к беспроводной сети сохранятся.
1.	Выключите маршрутизатор, нажав кнопку питания или отсоединив кабель питания.
2.	Выключите принтер и убедитесь, что нет подключенных кабелей USB или Ethernet. 
3.	Подключите кабель питания к маршрутизатору или включите его, затем подождите, пока индикатор активности подключения к Интернету не покажет нормальное состояние подключения.
4.	Включите принтер, затем попробуйте выполнить печать.
""",
"""Определите, какая у вас версия ОС Windows 10, 32-разрядная или 64-разрядная.
1.	В строке поиска Windows введите О вашем ПК.
2.	Выберите О вашем ПК в списке результатов.
3.	Версия и тип системы указаны на экране сведений.
""",
"""	Шаг 1. Дождитесь, пока принтер установит подключение 
Индикатор беспроводной связи мигает, когда принтер пытается подключиться к беспроводному маршрутизатору или точке доступа. Подождите несколько минут, затем снова проверьте световые индикаторы.
1.	Если индикатор беспроводной связи горит не мигая, принтер подключен, можно прекратить процедуру устранения неполадок.
2.	Если индикатор беспроводной связи все еще мигает, перейдите к следующему шагу.
Шаг 2. Проверка проблем, связанных с беспроводной сетью 
Следующие факторы могут быть причиной потери беспроводного соединения принтера:
1.	Сетевое подключение более неактивно, либо низкий уровень сигнала в сети.
2.	Принтер переключается в спящий режим (или режим ожидания).
3.	Принтер находится слишком далеко или слишком близко от беспроводного маршрутизатора. Рекомендованное расстояние между принтером и маршрутизатором – от 1,0 до 1,5 метров.
4.	Брандмауэр препятствует обращению принтера к компьютеру и беспроводной сети.
5.	Расположенное поблизости устройство, излучающее высокочастотные сигналы (например, микроволновая печь или беспроводной телефон), может создавать помехи беспроводному соединению.
6.	Виртуальная частная сеть (VPN) препятствует обращению принтера к компьютеру и беспроводной сети.
""",
"""•	В файле блокированной печати слишком много страниц, или файл слишком велик. Уменьшите количество страниц или уменьшите уровень параметра [Разрешение] в разделе [Кач.печ.]. Для получения подробной информации см. справку драйвера принтера.
•	В памяти аппарата уже хранится 5 заданий или 5 Мб данных блокированной печати. Распечатайте или удалите существующий файл блокированной печати.
""",
"""•	Время обработки зависит от объема данных. Для обработки данных большого объема, таких как документы с большим количеством графических изображений, потребуется большее количество времени.
•	Если на экране отображается надпись “Обработка...”, аппарат принимает данные. Подождите немного.
•	Чтобы ускорить распечатывание, уменьшите разрешение с помощью драйвера принтера. Для получения подробной информации см. справку драйвера принтера.
""",
"""•	Влажная бумага. Используйте правильно хранившуюся бумагу.
•	Поднимите ограничитель
""",
"""•	Если активировать параметр [Экономия тонера] в разделе [Парам.сист.], распечатывание выполняется, как правило, с меньшей плотностью.
•	Тонер почти полностью выработан. Если на экране появится сообщение "Требуется замена: Картридж печати", замените принт-картридж.
•	Возможно образование конденсата. При резкой смене температуры или влажности приступайте к эксплуатации аппарата не сразу, а после некоторой "акклиматизации".
""",
"Проверьте, надежно ли установлены рычаги за задней крышкой для печати на конвертах. Поднимите рычаги.",
"Проверьте, надежно ли установлены рычаги за задней крышкой для печати на конвертах. Опустите рычаги",
"""	При выполнении указанных рекомендаций большинства замятий бумаги можно избежать. 
• Проверьте правильность положения направляющих для бумаги. См. раздел Загрузка бумаги 
в лоток.
• Не перегружайте лоток. Не загружайте более 150 листов бумаги плотностью 80 г/кв.м. либо 
более 10 листов специальной бумаги или конвертов.
• Не вынимайте бумагу из лотка во время печати.
• Перед загрузкой согните пачку бумаги, распушите листы и выпрямите пачку. 
• Не используйте мятую, влажную или сильно скрученную бумагу.
• Не загружайте одновременно бумагу различных типов.
• Используйте только рекомендованные материалы для печати. См. раздел Типы материалов.
• Загружать материалы в лоток следует лицевой стороной вверх
""",
"""	1. Уберите бумагу из лотка.
2. Удалите застрявшую бумагув области лотка, осторожно вытянув ее наружу без перекосов.
3. Поднимите верхнюю крышку, а затем закройте ее. Печать автоматически возобновится. 
""",
"""1.	Откройте верхнюю крышку принтера.
2.	Извлеките принт-картридж.
3.	Поднимите перегородку, закрывающую тракт прохождения бумаги, и проверьте наличие замятий в роликах.
4.	Медленно и осторожно вытяните всю обнаруженную бумагу.
5.	Опустите перегородку и установите на место принт-картридж. 

""",
"""Проверьте максимальную емкость лотка.
• Убедиться, что используется правильная бумага. 
• Извлеките бумагу из лотка, перегните стопку или разведите листы 
веером.
• Бумага может слипаться при повышенной влажности.
• Возможно, в лоток загружена бумага различных типов. Загружайте 
в лоток бумагу только одного типа, формата и плотности.
""",
"""• Устраните помехи внутри аппарата.
• Бумага загружена неправильно. Извлеките бумагу из лотка и 
загрузите ее правильно.
• В лотке слишком много бумаги. Извлеките из лотка излишки бумаги.
• Бумага слишком плотная. Используйте только бумагу, 
соответствующую техническим характеристикам данного 
аппарата. 
""",
"""Используйте только прозрачные пленки, предназначенные для 
лазерных принтеров. Вынимайте прозрачные пленки сразу после 
их выхода из аппарата
""",
"Проверьте положение направляющих по обеим сторонам конверта.",
"""•  В лотке слишком много бумаги. Извлеките из лотка излишки бумаги.
•  Используется бумага неподходящего типа. Используйте только
бумагу, соответствующую техническим характеристикам данного
аппарата.
""",
"""1.Проверьте подключение шнура питания.
2.Проверьте выключатель и источник питания.
""",
"На компьютере выберите данный аппарат в качестве устройства, используемого по умолчанию в OC Windows.",
" Упростите страницу или измените настройки качества печати.",
" Измените ориентацию страницы.",
""" •	Убедитесь, что формат бумаги, заданный в драйвере печати,
	соответствует формату бумаги в лотке.
•  Формат бумаги, заданный в драйвере принтера, также должен соответствовать настройкам бумаги в
	используемом приложении.
""",
"""1. Отключите и снова подключите кабель аппарата. 
2. Проверьте
качество печати, повторно
отправив на печать документ,
который ранее печатался
успешно. 
3. Подключите кабель и
аппарат к другому, заведомо
исправному компьютеру, и
попробуйте вывести работу на
печать.
4. Попробуйте подключить новый
кабель.
 """,
"""•В соответствующем меню приложения проверьте, правильно
ли выбран принтер.
 """,
"""Отправьте документ на печать из другого приложения.
""",
"""1. Завершите работу Windows и перезагрузите компьютер.
2. Выключите принтер и снова включите его.
 """,
""" Измените параметр шрифта.
Настроить шрифт можно в разделе Device Settings (Параметры устройства) приложения Xerox
Easy Printer Manager на компьютере.
""",
"""1. Отключите питание принтера.
2. Отключите кабель аппарата и подключите его еще раз. 
3. Включите принтер.
 """,
"""1. Если возможно, подключите кабель к заведомо исправному компьютеру и напечатайте документ. 
2. Кроме того, можно попробовать подключить кабель от другого устройства.
 """,
"  Проверьте настройки принтера в операционной системе Windows и убедитесь, что работа печати отправляется на правильный порт.",
"Проверьте настройки драйвера принтера и убедитесь, что все параметры печати установлены правильно. ",
"Переустановите программное обеспечение принтера",
"""1. Проверьте индикатор статуса аппарата на панели управления, чтобы выяснить, не произошла ли серьезная ошибка. 
2. Обратитесь в сервисную службу.
""",
""" 1. Перераспределите тонер, чтобы проверить наличие его остатков в картридже. 
2. При необходимости замените принт-картридж.
""",
"Проверьте, имеются ли в файле пустые страницы.",
"Обратитесь в сервисную службу.",
"""1. Печать файла PDF в виде изображения не позволяет правильно напечатать документ.
2. В настройках печати Acrobat включите опцию Print As Image.
3. Печать файла PDF в виде изображения занимает больше времени, чем обычно.
 """,
"Попробуйте уменьшить размер фотографии. ",
"""•	Загрузите новую стопку бумаги.
•	Чтобы предотвратить поглощение избыточной влаги, не следует открывать упаковки с бумагой до
их использования.
 """,
""" •	  Проверьте, мигает ли индикатор доступа точки доступа.

•	Если на точке доступа активна функция безопасности «Privacy separator», изменить сетевые настройки принтера невозможно. Отключите эту функцию и попробуйте еще раз. Для более подробной информации обратитесь к документации на точку доступа.

•	 Если на точке доступа скрыт идентификатор SSID, введите SSID и пароль.  

•	Проверьте правильность ввода пароля. Пароль чувствителен к регистру.  

•	Убедитесь в правильности подключения принтера к сети.

•	 Проверьте, не выключен ли принтер. Если вы установили на принтере таймер отключения, принтер будет выключен по истечении определенного периода времени.

•	 Проверьте, не изменилось ли сетевое окружение. Если была осуществлена замена точки доступа, настройте сеть и подключите смарт-устройство и принтер к одной сети.

•	 Узнать, к какой сети подключен принтер, можно в столбце [SSID] листка состояния сети.
""",
""" ❏ Проверьте состояние точки доступа и убедитесь, что она функционирует нормально. Для более подробной информации обратитесь к документации на точку доступа.

❏ Если смарт-устройство не может получить сигнал с точки доступа, поместите их ближе друг к другу. При возникновении интерференции переместите оборудование дальше от другого оборудования, излучающего электромагнитные волны.

❏ Проверить мощность радиосигнала можно в столбце [Wireless] листка состояния сети. Мощность радиосигнала может быть недостаточной, если [Signal Strength] имеет значение [Fair].

❏ При возникновении конфликта IP-адресов сетевое соединение может стать нестабильным или недоступным. Назначьте каждому устройству уникальный IP-адрес.

❏  Проверить IP-адрес принтера можно в столбце [IP address] листка состояния сети.

❏ Соединение с сетью может отсутствовать, если сеть получает сигналы от слишком многих устройств. Уменьшите число устройств в сети, выключив неиспользуемые.

❏  Если на точке доступа скрыт идентификатор SSID, введите SSID и пароль.
""",
""" ❏ Проверьте, не выключен ли принтер. Если вы установили на принтере таймер отключения, принтер будет выключен по истечении определенного периода времени.

❏  Проверьте, мигает ли индикатор доступа точки доступа.

❏  С помощью команды «ping» убедитесь, что принтер и компьютер соединены.

❏ Если используется неправильный порт принтера, печать будет невозможно выполнить, либо печать может прерваться. Убедитесь, что настроен и выбран правильный порт принтера.

❏ Проверьте, не изменилось ли сетевое окружение. Если была осуществлена замена точки доступа, настройте сеть и подключите компьютер и принтер к одной сети.

❏  Узнать, к какой сети подключен принтер, можно в столбце [SSID] листка состояния сети.

❏ Если принтер не отображается на экране добавления принтеров при использовании Mac OS X и при использовании сети Wi-Fi, сетевое соединение между принтером и устройством может иметь низкий приоритет. Повысьте сетевой приоритет.
""",
""" ❏ Выполните первоначальную настройку всех сетевых настроек принтера и попробуйте снова установить сетевое соединение.

❏ Перезапустите сетевые устройства, такие, как точка доступа или принтер (учитывайте, что сетью могут пользоваться и другие пользователи).

❏ Проверьте последнюю версию внутреннего программного обеспечения для принтера и точки доступа. Если была выпущена более новая версия, обновите устройство.
""",
"Загрузите бумагу и нажмите кнопку I.",
"Поместите CD/DVD-диск в лоток для CD/DVD-дисков, вставьте лоток в принтер и нажмите кнопку I.",
"Извлеките бумагу, затем нажмите кнопку I.",
"""1. Извлеките бумагу. 
2. Если невозможно извлечь бумагу вручную, загрузите лист простой бумаги формата A4 в принтер и нажмите кнопку I для извлечения.
3. Извлеките бумагу. 
""",
"Закройте крышку принтера.",
"""1.Необходима замена прокладки, впитывающей чернила. Обратитесь с просьбой о замене прокладки, впитывающей чернила, в компанию Epson или
авторизованный сервисный центр Epson.
2.Когда на компьютере отображается сообщение о возможности продолжения печати, нажмите кнопку I
и возобновите печать. На определенное время индикаторы перестают мигать, однако начинают мигать
с постоянным интервалом до замены прокладки, впитывающей чернила.	
 """,
"""1. Откройте крышку принтера и извлеките любую бумагу или защитный материал из принтера. Выключите и 
выключите питание.
2. Если после выключения и включения питания сообщение об ошибке все еще появляется, обратитесь 
в службу поддержки. 
""",
""" ❏ Поставьте принтер на ровную поверхность и выполняйте эксплуатацию в рекомендуемых условиях. 
❏ Воспользуйтесь бумагой, подходящей для этого принтера.

❏  Следуйте инструкциям по работе с бумагой.
""",
"Загрузите бумагу в правильной ориентации и придвиньте направляющие к краям стопки.",
"Загрузите бумагу в правильной ориентации и придвиньте направляющие к краям стопки.",
""" ❏ Не превышайте максимально допустимое количество листов, указанное для определенного формата бумаги. Запрещается загружать простую бумагу выше значка треугольника на направляющей.

❏ При наличии листа для очистки, который поставляется вместе с подлинной бумагой Epson, произведите с помощью него очистку внутреннего ролика.

❏  Запрещается использовать бумагу с отверстиями для переплета.
""",
""" ❏ Убедитесь, что шнур питания устройства подключен надежно.
❏ Удерживайте кнопку P более длительное время.
""",
"""Рабочее напряжение принтера может не соответствовать напряжению розетки. 
Выключите устройство и немедленно отключите его от розетки. Проверьте информацию на этикетке принтера. 
""",
""" Зажмите кнопку P дольше. 
Если все еще не удается отключить принтер, выньте шнур питания. 
Во избежание высыхания печатающей головки необходимо опять включить принтер, после чего выключить
его нажатием кнопки P.
""",
"""❏  Установите драйвер принтера.

❏  Надежно подключите кабель USB к принтеру и компьютеру.

❏  Если используется USB-концентратор, попробуйте подключить принтер напрямую к компьютеру.

❏ При печати большого по объему изображения компьютеру может не хватить памяти. Напечатайте это изображение с более низким разрешением или в меньшем формате.

❏ В ОС Windows щелкните Очередь на печать на вкладке Сервис драйвера печати и проверьте следующие параметры.

❏ Проверьте наличие приостановленных заданий печати. При необходимости отмените печать.

❏  Убедитесь, что принтер не находится в автономном режиме или в режиме ожидания.

Если принтер находится в автономном режиме или режиме ожидания, отмените эти режимы в меню Принтер.

❏ Убедитесь, что принтер выбран в качестве принтера по умолчанию в меню Принтер (в элементе меню должен стоять флажок).

Если принтер не выбран принтером по умолчанию, его необходимо выбрать как принтер для использования по умолчанию.

❏  В меню Принтер убедитесь в выборе правильного порта (Свойства > Порт).

Выберите «USBXXX» для соединения через USB или «EpsonNet Print Port» для соединения по сети.
 """,
"""Если принтер долго не использовался, дюзы печатающих головок могли засориться и перестать пропускать чернила. 
Выполните проверку дюз и при необходимости очистите печатающую головку. 
""",
"""❏  Убедитесь в том, что первоначальная заправка чернил завершена.

❏ Проверьте контейнер для чернил. Если контейнер пуст, незамедлительно заправьте его чернилами и прочистите печатающую головку.

❏  Выполните проверку дюз и при необходимости прочистите печатающую головку.

❏ Если принтер не использовался длительный период времени, замените чернила внутри чернильных трубок.

❏  Откалибруйте печатающую головку.

❏  Используйте бумагу, подходящую для этого принтера.

❏  Не укладывайте бумагу в стопку сразу же после печати.

❏ Полностью высушите отпечатки, прежде чем использовать их по назначению. При просушке отпечатков не подвергайте их действию прямых солнечных лучей, не используйте фен и не касайтесь лицевой стороны отпечатка.

❏  Используйте емкости с чернилами с правильным кодом запчасти для своего принтера.

❏ При печати изображений или фотографий используйте файлы в высоком разрешении. Как правило, изображения на веб-сайтах имеют низкое разрешение, и хотя они хорошо выглядят на экране, качество при печати может заметно ухудшиться.
 """,
"""Возможно используется неправильная настройка типа бумаги. Выберите тип бумаги, соответствующий носителю, загруженному в принтер.
""",
""" Отрегулируйте настройки цвета и повторите печать. 
Функция автоматической корректировки цвета использует стандартный режим коррекции в PhotoEnhance. 
Попробуйте использовать другой режим коррекции PhotoEnhance, выбрав любой параметр, кроме Автокоррекция, в качестве настройки Коррекция сцены. 
Если проблему не удается устранить, воспользуйтесь другой функцией коррекции цвета вместо PhotoEnhance.
""",
"""	Выберите режим печати без полей. 
Если выбрать тип бумаги, который не поддерживает печать без полей, выбор параметра Без полей невозможен, выберите тип бумаги, который поддерживает печать без полей. 
""",
"Нажмите Настройки рядом с Без полей на вкладке драйвера принтера Главное, после чего измените настройки.",
"""❏ Если на отпечатках появляются горизонтальные полосы или размазываются чернила на верхней или нижней части бумаги, загрузите бумагу в правильном направлении и придвиньте направляющие к краям листа.

❏ Если на отпечатках появляются вертикальные полосы или размазываются чернила, выполните очистку бумагопроводящего тракта.
 """,
"""❏ Надежно подключите кабель USB к принтеру и компьютеру. 
❏ Отмените все приостановленные задания печати.

❏ Запрещается переводить компьютер в режим Гибернации или Сна во время печати. Страницы с искаженным текстом могут быть распечатаны в следующий раз при включении компьютера.
 """,
"""В драйвере принтера или приложении отключите все настройки зеркального отображения.

Снимите флажок Зеркально на вкладке драйвера принтера Дополнительные настройки;
 """,
"""❏  Закройте ненужные приложения.

❏  Уменьшите настройку качества. При высоком качестве снижается скорость печати.

❏ Включите параметр двунаправленности (или высокой скорости). При включении данного параметра печатающая головка печатает, двигаясь в обе стороны, в результате чего скорость печати увеличивается.

❏  Выберите Высокая скорость на вкладке Дополнительные настройки драйвера принтера.

❏ Отключите Тихий режим. 

❏ Отключите значение Тихий режим на вкладке драйвера принтера Главное.
""",
""" Печать замедляется во избежание повреждения перегрева и повреждения механизма принтера. 
Несмотря на это, печать можно продолжать. 
Чтобы вернуться к обычной скорости печати, ничего не печатайте на принтере как минимум в течение 30 минут. 
Скорость печати не возвращается к обычной, если отключить питание.
""",
"""Если к компьютеру подключено множество дополнительных устройств, то при касании к принтеру может ощущаться незначительный удар тока. 
Установите на компьютер, к которому подключен принтер, заземляющий провод. 
""",
""" Если во время работы появляется слишком громкий шум, включите Тихий режим. Включение этой функции может снизить скорость печати.

❏  Включите параметр Тихий режим на вкладке Главное драйвера принтера.
""",
""" Добавьте приложение в список программ, разрешенных брандмауэром Windows, в настройках безопасности на Панели управления.
""",
]